In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("sample_data_100_rows.csv")

In [3]:
df

     ID     Name  Age  Salary Department
0     1      Ian   30   89520      Sales
1     2  Charlie   46   89811         HR
2     3     Jack   26   97340  Marketing
3     4    Frank   31   86707  Marketing
4     5     Jack   24  117304    Finance
..  ...      ...  ...     ...        ...
95   96    David   29  114891  Marketing
96   97    Grace   50   60185         IT
97   98    Grace   25   60976  Marketing
98   99      Eve   26   45558    Finance
99  100    Grace   44   55409      Sales

[100 rows x 5 columns]

In [4]:
pd.read_excel("Bro.xlsx")

   Unnamed: 0    Name  Marks       City
0           0    Asim     80     Amroha
1           1   Najim     90  Moradabad
2           2   Salim     85      Delhi
3           3  Faizan     70     Meerut

In [5]:
dict1 = {
    "Name" : ["Alia", "Preet", "Janvi", "Anam Khan"],
    "Marks" : [70, 75, 80, 95],
    "City" : ["Moradabad", "Delhi", "Jothpur", "Amroha"]
}

In [6]:
df = pd.DataFrame(dict1)

In [7]:
df

        Name  Marks       City
0       Alia     70  Moradabad
1      Preet     75      Delhi
2      Janvi     80    Jothpur
3  Anam Khan     95     Amroha

In [8]:
df.to_csv("Girls.csv", index=False)

In [9]:
df

        Name  Marks       City
0       Alia     70  Moradabad
1      Preet     75      Delhi
2      Janvi     80    Jothpur
3  Anam Khan     95     Amroha

In [10]:
df.dtypes

Name     object
Marks     int64
City     object
dtype: object

In [11]:
pd.read_csv("Asim.csv")

   Train NO.  Speed       City
0     123453     50     Amroha
1      23412     90  Moradabad
2     243222     85      Delhi
3     232322     70     Meerut

In [12]:
pd.read_csv("Girls.csv")

        Name  Marks       City
0       Alia     70  Moradabad
1      Preet     75      Delhi
2      Janvi     80    Jothpur
3  Anam Khan     95     Amroha

In [13]:
dt = {
    "Name" : ["Priya", "Disha", "Shurti"],
    "Age" : [23, 27, 33],
    "City" : ["Mubai", "Pune", "Bengulure"]
}

In [14]:
dt = pd.DataFrame(dt)

In [15]:
dt

     Name  Age       City
0   Priya   23      Mubai
1   Disha   27       Pune
2  Shurti   33  Bengulure

In [16]:
dt.to_csv("Dat.csv", index=False)

In [17]:
dt.to_json("Dat.json", index=False)